/*public class Comparand {

    public Comparand() {
    }

    YearlyReport yreport = new YearlyReport(2021, "resources/y.2021.csv");
    MonthlyReport mreport1 = new MonthlyReport(01, "resources/m.202101.csv");
    MonthlyReport mreport2 = new MonthlyReport(02, "resources/m.202102.csv");
    MonthlyReport mreport3 = new MonthlyReport(03, "resources/m.202103.csv");

    //сначала подсчитать общие доходы по январю

    //подсчитать доходы по январю за год, как

    public void monthsToYearCompare() {
        for (yreport.rows row: yreport.rows) {
            if (row.month = 1) {}
        }
    }

}
/*
Сверка данных — это проверка, что данные в двух и более разных источниках не противоречат друг другу.

В данном случае при сверке данных вам нужно проверить,
что информация по месяцу в годовом отчёте не противоречит информации в месячном отчёте.

1! Сначала один месяц
Если месяц январь, то сверка с январем

При вызове сверки данных программа должна:
Подсчитывать две суммы: общие доходы и общие расходы по каждому из месяцев.
Сверять полученные суммы с суммой доходов и расходов в отчёте по году.
Если обнаружена ошибка, программа должна выводить месяц, в котором обнаружено несоответствие.
Если ошибок не обнаружено, должна выводиться только информация об успешном завершении операции.
 */